---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElevAssocDatum
source: html/36e30e7b-0a26-4aa2-8c88-db27ad8a5fb5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElevAssocDatum Property

"Associated Datum"

## Syntax (C#)
```csharp
public static ForgeTypeId ElevAssocDatum { get; }
```